of7/applications/run/dispersionAroundBuildings/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injector1
{
    timeStart       0;
    duration        3000;
    selectionMode   points;
    points
    (
        (55 62 2)
    );
}

options
{
    CSource1
    {
        type            scalarSemiImplicitSource;

        $injector1;

        volumeMode      specific;
        injectionRateSuSp
        {
            C     (3000 0); // kg/m3
        }
    }
}


// ************************************************************************* //
